# IFCTransaction Properties

---
The IFCTransaction type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
IFCTransaction Class
Autodesk.Revit.DB.IFC Namespace